zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/otfc_reg.h
#define OTFC_CTL_EN0_Pos                 (0)                                               /*!< OTFC_T::CTL: EN0 Position              */
#define OTFC_CTL_EN0_Msk                 (0x1ul << OTFC_CTL_EN0_Pos)                       /*!< OTFC_T::CTL: EN0 Mask                  */

#define OTFC_CTL_RST0_Pos                (1)                                               /*!< OTFC_T::CTL: RST0 Position             */
#define OTFC_CTL_RST0_Msk                (0x1ul << OTFC_CTL_RST0_Pos)                      /*!< OTFC_T::CTL: RST0 Mask                 */

#define OTFC_CTL_KSWAP0_Pos              (2)                                               /*!< OTFC_T::CTL: KSWAP0 Position           */
#define OTFC_CTL_KSWAP0_Msk              (0x1ul << OTFC_CTL_KSWAP0_Pos)                    /*!< OTFC_T::CTL: KSWAP0 Mask               */

#define OTFC_CTL_IEN0_Pos                (7)                                               /*!< OTFC_T::CTL: IEN0 Position             */
#define OTFC_CTL_IEN0_Msk                (0x1ul << OTFC_CTL_IEN0_Pos)                      /*!< OTFC_T::CTL: IEN0 Mask                 */

#define OTFC_CTL_EN1_Pos                 (8)                                               /*!< OTFC_T::CTL: EN1 Position              */
#define OTFC_CTL_EN1_Msk                 (0x1ul << OTFC_CTL_EN1_Pos)                       /*!< OTFC_T::CTL: EN1 Mask                  */

#define OTFC_CTL_RST1_Pos                (9)                                               /*!< OTFC_T::CTL: RST1 Position             */
#define OTFC_CTL_RST1_Msk                (0x1ul << OTFC_CTL_RST1_Pos)                      /*!< OTFC_T::CTL: RST1 Mask                 */

#define OTFC_CTL_KSWAP1_Pos              (10)                                              /*!< OTFC_T::CTL: KSWAP1 Position           */
#define OTFC_CTL_KSWAP1_Msk              (0x1ul << OTFC_CTL_KSWAP1_Pos)                    /*!< OTFC_T::CTL: KSWAP1 Mask               */

#define OTFC_CTL_IEN1_Pos                (15)                                              /*!< OTFC_T::CTL: IEN1 Position             */
#define OTFC_CTL_IEN1_Msk                (0x1ul << OTFC_CTL_IEN1_Pos)                      /*!< OTFC_T::CTL: IEN1 Mask                 */

#define OTFC_CTL_EN2_Pos                 (16)                                              /*!< OTFC_T::CTL: EN2 Position              */
#define OTFC_CTL_EN2_Msk                 (0x1ul << OTFC_CTL_EN2_Pos)                       /*!< OTFC_T::CTL: EN2 Mask                  */

#define OTFC_CTL_RST2_Pos                (17)                                              /*!< OTFC_T::CTL: RST2 Position             */
#define OTFC_CTL_RST2_Msk                (0x1ul << OTFC_CTL_RST2_Pos)                      /*!< OTFC_T::CTL: RST2 Mask                 */

#define OTFC_CTL_KSWAP2_Pos              (18)                                              /*!< OTFC_T::CTL: KSWAP2 Position           */
#define OTFC_CTL_KSWAP2_Msk              (0x1ul << OTFC_CTL_KSWAP2_Pos)                    /*!< OTFC_T::CTL: KSWAP2 Mask               */

#define OTFC_CTL_IEN2_Pos                (23)                                              /*!< OTFC_T::CTL: IEN2 Position             */
#define OTFC_CTL_IEN2_Msk                (0x1ul << OTFC_CTL_IEN2_Pos)                      /*!< OTFC_T::CTL: IEN2 Mask                 */

#define OTFC_CTL_EN3_Pos                 (24)                                              /*!< OTFC_T::CTL: EN3 Position              */
#define OTFC_CTL_EN3_Msk                 (0x1ul << OTFC_CTL_EN3_Pos)                       /*!< OTFC_T::CTL: EN3 Mask                  */

#define OTFC_CTL_RST3_Pos                (25)                                              /*!< OTFC_T::CTL: RST3 Position             */
#define OTFC_CTL_RST3_Msk                (0x1ul << OTFC_CTL_RST3_Pos)                      /*!< OTFC_T::CTL: RST3 Mask                 */

#define OTFC_CTL_KSWAP3_Pos              (26)                                              /*!< OTFC_T::CTL: KSWAP3 Position           */
#define OTFC_CTL_KSWAP3_Msk              (0x1ul << OTFC_CTL_KSWAP3_Pos)                    /*!< OTFC_T::CTL: KSWAP3 Mask               */

#define OTFC_CTL_IEN3_Pos                (31)                                              /*!< OTFC_T::CTL: IEN3 Position             */
#define OTFC_CTL_IEN3_Msk                (0x1ul << OTFC_CTL_IEN3_Pos)                      /*!< OTFC_T::CTL: IEN3 Mask                 */

#define OTFC_STS_BUSY0_Pos               (0)                                               /*!< OTFC_T::STS: BUSY0 Position            */
#define OTFC_STS_BUSY0_Msk               (0x1ul << OTFC_STS_BUSY0_Pos)                     /*!< OTFC_T::STS: BUSY0 Mask                */

#define OTFC_STS_KSERR0_Pos              (5)                                               /*!< OTFC_T::STS: KSERR0 Position           */
#define OTFC_STS_KSERR0_Msk              (0x1ul << OTFC_STS_KSERR0_Pos)                    /*!< OTFC_T::STS: KSERR0 Mask               */

#define OTFC_STS_DFAERR0_Pos             (6)                                               /*!< OTFC_T::STS: DFAERR0 Position          */
#define OTFC_STS_DFAERR0_Msk             (0x1ul << OTFC_STS_DFAERR0_Pos)                   /*!< OTFC_T::STS: DFAERR0 Mask              */

#define OTFC_STS_IF0_Pos                 (7)                                               /*!< OTFC_T::STS: IF0 Position              */
#define OTFC_STS_IF0_Msk                 (0x1ul << OTFC_STS_IF0_Pos)                       /*!< OTFC_T::STS: IF0 Mask                  */

#define OTFC_STS_BUSY1_Pos               (8)                                               /*!< OTFC_T::STS: BUSY1 Position            */
#define OTFC_STS_BUSY1_Msk               (0x1ul << OTFC_STS_BUSY1_Pos)                     /*!< OTFC_T::STS: BUSY1 Mask                */

#define OTFC_STS_KSERR1_Pos              (13)                                              /*!< OTFC_T::STS: KSERR1 Position           */
#define OTFC_STS_KSERR1_Msk              (0x1ul << OTFC_STS_KSERR1_Pos)                    /*!< OTFC_T::STS: KSERR1 Mask               */

#define OTFC_STS_DFAERR1_Pos             (14)                                              /*!< OTFC_T::STS: DFAERR1 Position          */
#define OTFC_STS_DFAERR1_Msk             (0x1ul << OTFC_STS_DFAERR1_Pos)                   /*!< OTFC_T::STS: DFAERR1 Mask              */

