zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/otfc_reg.h
#define OTFC_STS_IF1_Pos                 (15)                                              /*!< OTFC_T::STS: IF1 Position              */
#define OTFC_STS_IF1_Msk                 (0x1ul << OTFC_STS_IF1_Pos)                       /*!< OTFC_T::STS: IF1 Mask                  */

#define OTFC_STS_BUSY2_Pos               (16)                                              /*!< OTFC_T::STS: BUSY2 Position            */
#define OTFC_STS_BUSY2_Msk               (0x1ul << OTFC_STS_BUSY2_Pos)                     /*!< OTFC_T::STS: BUSY2 Mask                */

#define OTFC_STS_KSERR2_Pos              (21)                                              /*!< OTFC_T::STS: KSERR2 Position           */
#define OTFC_STS_KSERR2_Msk              (0x1ul << OTFC_STS_KSERR2_Pos)                    /*!< OTFC_T::STS: KSERR2 Mask               */

#define OTFC_STS_DFAERR2_Pos             (22)                                              /*!< OTFC_T::STS: DFAERR2 Position          */
#define OTFC_STS_DFAERR2_Msk             (0x1ul << OTFC_STS_DFAERR2_Pos)                   /*!< OTFC_T::STS: DFAERR2 Mask              */

#define OTFC_STS_IF2_Pos                 (23)                                              /*!< OTFC_T::STS: IF2 Position              */
#define OTFC_STS_IF2_Msk                 (0x1ul << OTFC_STS_IF2_Pos)                       /*!< OTFC_T::STS: IF2 Mask                  */

#define OTFC_STS_BUSY3_Pos               (24)                                              /*!< OTFC_T::STS: BUSY3 Position            */
#define OTFC_STS_BUSY3_Msk               (0x1ul << OTFC_STS_BUSY3_Pos)                     /*!< OTFC_T::STS: BUSY3 Mask                */

#define OTFC_STS_KSERR3_Pos              (29)                                              /*!< OTFC_T::STS: KSERR3 Position           */
#define OTFC_STS_KSERR3_Msk              (0x1ul << OTFC_STS_KSERR3_Pos)                    /*!< OTFC_T::STS: KSERR3 Mask               */

#define OTFC_STS_DFAERR3_Pos             (30)                                              /*!< OTFC_T::STS: DFAERR3 Position          */
#define OTFC_STS_DFAERR3_Msk             (0x1ul << OTFC_STS_DFAERR3_Pos)                   /*!< OTFC_T::STS: DFAERR3 Mask              */

#define OTFC_STS_IF3_Pos                 (31)                                              /*!< OTFC_T::STS: IF3 Position              */
#define OTFC_STS_IF3_Msk                 (0x1ul << OTFC_STS_IF3_Pos)                       /*!< OTFC_T::STS: IF3 Mask                  */

#define OTFC_PR_SADDR_SADDR_Pos          (0)                                               /*!< OTFC_T::PR_SADDR: SADDR Position      */
#define OTFC_PR_SADDR_SADDR_Msk          (0xfffffffful << OTFC_PR_SADDR_SADDR_Pos)         /*!< OTFC_T::PR_SADDR: SADDR Mask          */

#define OTFC_PR_EADDR_EADDR_Pos          (0)                                               /*!< OTFC_T::PR_EADDR: EADDR Position      */
#define OTFC_PR_EADDR_EADDR_Msk          (0xfffffffful << OTFC_PR_EADDR_EADDR_Pos)         /*!< OTFC_T::PR_EADDR: EADDR Mask          */

#define OTFC_PR_KSCTL_NUM_Pos            (0)                                               /*!< OTFC_T::PR_KSCTL: NUM Position        */
#define OTFC_PR_KSCTL_NUM_Msk            (0x1ful << OTFC_PR_KSCTL_NUM_Pos)                 /*!< OTFC_T::PR_KSCTL: NUM Mask            */

#define OTFC_PR_KSCTL_RSRC_Pos           (5)                                               /*!< OTFC_T::PR_KSCTL: RSRC Position       */
#define OTFC_PR_KSCTL_RSRC_Msk           (0x1ul << OTFC_PR_KSCTL_RSRC_Pos)                 /*!< OTFC_T::PR_KSCTL: RSRC Mask           */

#define OTFC_PR_KSCTL_RSSRC_Pos          (6)                                               /*!< OTFC_T::PR_KSCTL: RSSRC Position      */
#define OTFC_PR_KSCTL_RSSRC_Msk          (0x3ul << OTFC_PR_KSCTL_RSSRC_Pos)                /*!< OTFC_T::PR_KSCTL: RSSRC Mask          */

#define OTFC_PR_KEY0_KEY_Pos             (0)                                               /*!< OTFC_T::PR_KEY0: KEY Position         */
#define OTFC_PR_KEY0_KEY_Msk             (0xfffffffful << OTFC_PR_KEY0_KEY_Pos)            /*!< OTFC_T::PR_KEY0: KEY Mask             */

#define OTFC_PR_KEY1_KEY_Pos             (0)                                               /*!< OTFC_T::PR_KEY1: KEY Position         */
#define OTFC_PR_KEY1_KEY_Msk             (0xfffffffful << OTFC_PR_KEY1_KEY_Pos)            /*!< OTFC_T::PR_KEY1: KEY Mask             */

#define OTFC_PR_KEY2_KEY_Pos             (0)                                               /*!< OTFC_T::PR_KEY2: KEY Position         */
#define OTFC_PR_KEY2_KEY_Msk             (0xfffffffful << OTFC_PR_KEY2_KEY_Pos)            /*!< OTFC_T::PR_KEY2: KEY Mask             */

#define OTFC_PR_KEY3_KEY_Pos             (0)                                               /*!< OTFC_T::PR_KEY3: KEY Position         */
#define OTFC_PR_KEY3_KEY_Msk             (0xfffffffful << OTFC_PR_KEY3_KEY_Pos)            /*!< OTFC_T::PR_KEY3: KEY Mask             */

#define OTFC_PR_SCRAMBLE_SCRAMBLE_Pos    (0)                                               /*!< OTFC_T::PR_SCRAMBLE: SCRAMBLE Position*/
#define OTFC_PR_SCRAMBLE_SCRAMBLE_Msk    (0xfffffffful << OTFC_PR_SCRAMBLE_SCRAMBLE_Pos)   /*!< OTFC_T::PR_SCRAMBLE: SCRAMBLE Mask    */

#define OTFC_PR_NONCE0_NONCE_Pos         (0)                                               /*!< OTFC_T::PR_NONCE0: NONCE Position     */
#define OTFC_PR_NONCE0_NONCE_Msk         (0xfffffffful << OTFC_PR_NONCE0_NONCE_Pos)        /*!< OTFC_T::PR_NONCE0: NONCE Mask         */

#define OTFC_PR_NONCE1_NONCE_Pos         (0)                                               /*!< OTFC_T::PR_NONCE1: NONCE Position     */
#define OTFC_PR_NONCE1_NONCE_Msk         (0xfffffffful << OTFC_PR_NONCE1_NONCE_Pos)        /*!< OTFC_T::PR_NONCE1: NONCE Mask         */

#define OTFC_PR_NONCE2_NONCE_Pos         (0)                                               /*!< OTFC_T::PR_NONCE2: NONCE Position     */
#define OTFC_PR_NONCE2_NONCE_Msk         (0xfffffffful << OTFC_PR_NONCE2_NONCE_Pos)        /*!< OTFC_T::PR_NONCE2: NONCE Mask         */

/** @} OTFC_CONST */
/** @} end of OTFC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __OTFC_REG_H__ */
